package com.sanguo.Fragment.data.wujiang;

/**
 * Created by jinrong on 2016/4/19.
 */
public class wujiang_data {


    public static String[] shu_names = new String[]{
            "赵云", "姜维", "关羽", "徐庶", "诸葛亮", "李严", "孙尚香", "张嶷", "刘备", "法正",
            "马谡", "马忠", "黄权", "董厥", "严颜", "罗憲", "李恢",
            "吴懿", "黄忠", "王平", "诸葛瞻", "张翼", "霍弋", "蒋琬", "夏侯霸", "孟达", "关平",
            "黄崇", "霍峻", "邓芝", "马超", "庞统", "魏延", "马云禄", "陈到",
            "杨仪", "傅僉", "关兴", "向宠", "费纬", "刘睿", "马岱", "廖化", "诸葛尚", "黄月英", "董和",
            "赵统", "张苞", "关索", "泠苞", "梁绪", "傅暇", "胡济",
            "李球", "张遵", "关统", "王甫", "吴班", "刘封", "马良", "庞羲", "周仓", "赵广",
            "阎宇", "刘馈", "王伉", "张飞", "陈震", "朵思大王", "孟获", "雷铜",
            "高翔", "尹赏", "王买", "申耽", "巩志", "樊建", "董允", "李歆", "糜竺", "冯习",
            "傅彤", "孙乾", "董荼那", "吴兰", "鄂焕", "祝融", "蒋舒", "赵累",
            "阿会喃", "伊籍", "关彝", "蒋斌", "沙摩柯", "李丰", "带来洞主", "金环三结",
            "王含", "陈式", "向朗", "刘巴", "简雍", "刘循", "刘湛", "朱褒", "许靖", "裴元绍",
            "尹默", "陈寿", "秦宓", "诸葛均", "陈琳", "郭攸之", "糜芳", "木鹿大王", "傅士仁",
            "兀突骨", "孟优", "忙牙长", "蒋显", "谯周", "郤正", "邓良", "张绍", "马邈", "黄皓", "刘禅"
    };

    public static String[] wu_names = new String[]{
            "周瑜", "陆逊", "孙坚", "孙策", "鲁肃", "徐盛", "陆抗", "程普", "孙权", "朱桓", "孙桓",
            "步陟", "孙韶", "张承", "马忠", "黄盖", "朱拠", "全琮", "陆凯", "孙瑜", "骆统", "太史慈",
            "吕岱", "陆景", "贺齐", "陶璜", "吾彦", "吕范", "张悌",
            "孙登", "朱然", "诸葛瑾", "丁奉", "鲁淑", "朱异", "韩当", "朱治", "留平", "甘宁", "孙异",
            "留赞", "诸葛恪", "陈表", "步闡", "虞汜", "吕蒙", "吾粲",
            "祖茂", "钟離斐", "凌统", "阚泽", "周泰", "全纪", "孙休", "诸葛靓", "步协", "虞翻", "留略",
            "孟宗", "盛曼", "孙静", "沈莹", "蒋钦", "潘璋", "吕凯",
            "伍延", "陶濬", "张休", "董袭", "陈武", "陈元", "魏邈", "孙冀", "凌操", "太史享",
            "潘睿", "周鲂", "孙震", "孙歆", "王惇", "张俨", "滕胤", "丁封",
            "张昭", "宋谦", "蔡贡", "张紘", "脩则", "孙霸", "脩允", "孙峻", "顾谭", "于诠",
            "刘俊", "张英", "全端", "顾雍", "孙和", "濮阳兴", "全懌", "张象",
            "薛莹", "薛综", "谢旌", "孙匡", "孙诩", "楼玄", "贾华", "李异", "刘丞", "张布",
            "孙亮", "张温", "谭雄", "韦昭", "施朔", "薛珝", "程秉", "滕脩",
            "陆绩", "孙箪", "孙朗", "董朝", "孙述", "孙懋", "杨柏", "何植", "孙皓", "全尚", "岑昏"
    };

    public static String[] han_names = new String[]{
            "何进", "卢植", "皇甫嵩", "王允", "鲍信", "朱儁", "周昕", "邹靖",
            "桥瑁", "袁遗", "董承", "许贡", "张邈", "丁原", "皇甫凯", "刘岱", "刘繇",
            "陈应", "刘贤", "陶谦", "郭马", "鲍隆", "曹豹", "陈横", "韩嵩",
            "刑道荣", "高定", "陈珪", "笮融", "孔侑", "王粲", "金旋", "穆顺", "孔融",
            "武安国", "赵范", "韩馥", "潘凤", "刘度", "韩玄", "张扬"
    };

    public static String[] hanzei_names = new String[]{
            "雍凯", "严白虎", "严兴", "严政", "眭固"
    };

    public static String[] jin_names = new String[]{
            "司马懿","司马师","司马昭","司马炎",
            "杨肇", "杨济", "牵弘", "杨稷", "胡渊", "毛炅", "王戎", "王韬", "孙秀", "张华",
            "田章", "周旨", "张尚", "荀勗", "诸葛绪", "郑冲", "荀顗", "胡冲"
    };

    public static String[] zhangjiao_names = new String[]{
            "张角", "张梁", "张宝", "张燕", "邓茂", "龚都", "刘辟", "韩暹", "程远志", "高升", "孙仲", "赵弘",
            "管亥", "韩忠", "杨奉", "何仪"
    };

    public static String[] liuyan_names = new String[]{
            "刘焉", "张任", "高沛", "杨怀", "刘璋", "邓贤", "王累", "张松"
    };

    public static String[] yuanshao_names = new String[]{
            "袁绍", "审配", "沮授", "田丰", "高览", "袁熙", "颜良", "袁尚", "吕旷", "吕翔", "辛评", "蒋义渠",
            "沮鵠", "高干", "郭图", "麹义", "文丑", "王門", "苏由", "吕威璜", "荀谌", "淳于琼", "袁谭",
            "逢纪", "许攸"
    };

    public static String[] liubiao_names = new String[]{
            "刘表", "蔡瑁", "文聘", "蒯良", "张允", "苏飞", "蔡中", "蔡和", "刘琦", "刘琮", "黄祖", "蒯越",
            "王威", "吴巨"
    };

    public static String[] lvbu_names = new String[]{
            "吕布", "陈宫", "高顺", "侯成", "曹性", "宋宪", "魏续"
    };

    public static String[] gongsunzan_names = new String[]{
            "公孙瓒", "公孙范", "田楷", "公孙续", "单经", "公孙越", "严纲", "关靖", "邹丹"
    };

    public static String[] gongsuandu_names = new String[]{
            "公孙康", "公孙度", "贾范", "公孙渊", "伦直", "卑衍", "杨祚", "公孙恭"
    };

    public static String[] dongzhuo_names = new String[]{
            "董卓", "华雄", "李儒", "徐荣", "牛辅", "董旻", "李傕", "李肃", "张济", "樊稠", "胡车儿", "郭汜",
            "胡轸"
    };

    public static String[] yuanshu_names = new String[]{
            "袁术", "纪灵", "袁胤", "乐就", "陈兰", "陈纪", "俞涉", "阎象", "袁燿", "雷薄", "韩胤", "杨弘"
    };

    public static String[] zhanglu_names = new String[]{
            "张鲁", "杨松", "杨任", "阎圃", "张卫", "杨昂", "杨丑"
    };

    public static String[] xiliang_names = new String[]{
            "马腾", "韩遂", "马铁", "成宜", "程银", "马休", "侯选", "李堪", "马玩", "张横", "梁兴"
    };

    public static String[] wangkuang_names = new String[]{
            "王匡", "方悦"
    };

    public static String[] liuyu_names = new String[]{
            "刘虞", "魏攸"
    };
}
